Revit 2027 API
FabricationSaveJobOptions(Boolean) Constructor
 Constructor
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationSaveJobOptions(
	bool addHolesForTaps
)
Public Sub New (
	addHolesForTaps As Boolean
)
public:
FabricationSaveJobOptions(
	bool addHolesForTaps
)
new :
        addHolesForTaps : bool -> FabricationSaveJobOptions
Parameters
addHolesForTaps Boolean
 Set true to have holes for taps on straights added to the created fabrication job.
See Also
Reference
FabricationSaveJobOptions Class
FabricationSaveJobOptions Overload
Autodesk.Revit.DB.Fabrication Namespace